app/controllers/graphics_controller.rb

  def gestor
    @devolutions = Devolution.group_by_week(:created_at).count
---
SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d 00:00:00 UTC', "devolutions"."created_at", '-6 days', 'weekday 0') AS strftime_y_m_d_00_00_00_utc_devolutions_created_at_6_days_weekda FROM "devolutions" WHERE ("devolutions"."created_at" IS NOT NULL) GROUP BY strftime('%Y-%m-%d 00:00:00 UTC', "devolutions"."created_at", '-6 days', 'weekday 0')