app/views/graphics/gestor.html.erb

SELECT COUNT(*) AS count_all, strftime('%Y-%m-%d %H:%M:00 UTC', "devolutions"."created_at") AS strftime_y_m_d_h_m_00_utc_devolutions_created_at FROM "devolutions" WHERE ("devolutions"."created_at" IS NOT NULL) GROUP BY strftime('%Y-%m-%d %H:%M:00 UTC', "devolutions"."created_at")
---
  <div class="col s6 card-panel">
    <%= line_chart Devolution.group_by_minute(:created_at).count, label: 'Chegada das devoluções', xtitle: "Horário de chegada", ytitle: "Devoluções"%>

SELECT COUNT(*) AS count_all, "devolutions"."status" AS devolutions_status FROM "devolutions" GROUP BY "devolutions"."status"
---
  <div class="col s4 card-panel">
    <%= pie_chart( Devolution.group(:status).count ) %>

SELECT COUNT(*) AS count_all, "devolutions"."product" AS devolutions_product FROM "devolutions" GROUP BY "devolutions"."product"
---
  <div class="col s3"></div>
  <div class="col s6 card-panel"><%= bar_chart Devolution.group(:product).count %></div>